# Dependencias

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

# Carga

In [2]:
path = '../data/raw/train.csv'
df = pd.read_csv(path)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
442,443,0,3,"Petterson, Mr. Johan Emil",male,25.00,1,0,347076,7.775,NaN,S
562,563,0,2,"Norman, Mr. Robert Douglas",male,28.00,0,0,218629,13.500,NaN,S
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.750,NaN,S
651,652,1,2,"Doling, Miss. Elsie",female,18.00,0,1,231919,23.000,NaN,S
598,599,0,3,"Boulos, Mr. Hanna",male,NaN,0,0,2664,7.225,NaN,C

# Modificando ~ imputando

In [5]:
# Se realiza un copia del df original
# Esto permiteconservar el DataFrame original para futuras comparaciones o restauraciones.
df_copy = df.copy()

## Columna `PassengerId`
Eliminar columna segun las `Acciones a realizar` **-índice-** en la fase exploratoria (EDA)
[Ir a análisis exploratorio](./01_exploration.ipynb)

In [6]:
df_copy.drop('PassengerId', axis=1, inplace=True)

## Columna `Age`
Segun las `Acciones a realizar` **-índice-** en la fase exploratoria (EDA)
[Ir a análisis exploratorio](./01_exploration.ipynb)

promedio de edad por sexo

In [7]:
# Cantidad de valores faltantes
df.loc[df['Age'].isnull(),['Sex']].count()

Sex    177
dtype: int64

In [8]:
# Guarda en la variable los índices de todas las filas donde la columna `Age` tiene un valor nulo.
edades_nan = list(df.loc[df['Age'].isnull(),['Age']].index)
edades_nan

[5,
 17,
 19,
 26,
 28,
 29,
 31,
 32,
 36,
 42,
 45,
 46,
 47,
 48,
 55,
 64,
 65,
 76,
 77,
 82,
 87,
 95,
 101,
 107,
 109,
 121,
 126,
 128,
 140,
 154,
 158,
 159,
 166,
 168,
 176,
 180,
 181,
 185,
 186,
 196,
 198,
 201,
 214,
 223,
 229,
 235,
 240,
 241,
 250,
 256,
 260,
 264,
 270,
 274,
 277,
 284,
 295,
 298,
 300,
 301,
 303,
 304,
 306,
 324,
 330,
 334,
 335,
 347,
 351,
 354,
 358,
 359,
 364,
 367,
 368,
 375,
 384,
 388,
 409,
 410,
 411,
 413,
 415,
 420,
 425,
 428,
 431,
 444,
 451,
 454,
 457,
 459,
 464,
 466,
 468,
 470,
 475,
 481,
 485,
 490,
 495,
 497,
 502,
 507,
 511,
 517,
 522,
 524,
 527,
 531,
 533,
 538,
 547,
 552,
 557,
 560,
 563,
 564,
 568,
 573,
 578,
 584,
 589,
 593,
 596,
 598,
 601,
 602,
 611,
 612,
 613,
 629,
 633,
 639,
 643,
 648,
 650,
 653,
 656,
 667,
 669,
 674,
 680,
 692,
 697,
 709,
 711,
 718,
 727,
 732,
 738,
 739,
 740,
 760,
 766,
 768,
 773,
 776,
 778,
 783,
 790,
 792,
 793,
 815,
 825,
 826,
 828,
 832,
 837,
 839,
 846,
 849,
 859,
 863,
 868,
 878,
 888]

In [9]:
#  Permite ver el sexo y la edad (que será NaN) de los pasajeros que tienen valores faltantes en la columna Age.
df.loc[edades_nan,['Sex', 'Age']]

        Sex  Age
5      male  NaN
17     male  NaN
19   female  NaN
26     male  NaN
28   female  NaN
..      ...  ...
859    male  NaN
863  female  NaN
868    male  NaN
878    male  NaN
888  female  NaN

[177 rows x 2 columns]

In [10]:
# Muestra todas las filas del DataFrame `df_copy` donde la columna Age es NaN (faltante) y la columna Sex es 'male'.
df_copy[(df['Age'].isnull()) & (df['Sex'] == 'male')]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
26,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
29,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
36,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
839,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
846,0,3,"Sage, Mr. Douglas Bullen",male,NaN,8,2,CA. 2343,69.5500,NaN,S
859,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
868,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S

### Asignando valores

Asigna el valor 30.7 a la columna `Age` en todas las filas de `df_copy` donde Age es NaN (faltante) y Sex es '**male**'.

In [11]:
df_copy.loc[(df_copy['Age'].isnull()) & (df_copy['Sex'] == 'male'),'Age'] = 30.7

Asigna el valor 27.9 a la columna `Age` en todas las filas de `df_copy` donde Age es NaN (faltante) y Sex es '**female**'.

In [12]:
df_copy.loc[(df_copy['Age'].isnull()) & (df_copy['Sex'] == 'female'),'Age'] = 27.9

In [13]:
# Verificacion
df_copy.loc[edades_nan,['Sex', 'Age']]

        Sex   Age
5      male  30.7
17     male  30.7
19   female  27.9
26     male  30.7
28   female  27.9
..      ...   ...
859    male  30.7
863  female  27.9
868    male  30.7
878    male  30.7
888  female  27.9

[177 rows x 2 columns]

In [14]:
# Verificacion de cantidad de NaN en `df_copy`
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       891 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

## Columna `Cabin`

### **Convertimos la columna `Cabin` en una variable binaria:**

- **0** si el valor era faltante (no tenía cabina asignada)  
- **1** si tenía un valor (sí tenía cabina asignada)

Segun las `Acciones a realizar` **-índice-** en la fase exploratoria (EDA)
[Ir a análisis exploratorio](./01_exploration.ipynb)

**Generamos indice para los datos `NaN`**

In [15]:
# Guarda en la variable los índices de todas las filas donde la columna `Cabin` tiene valores faltantes.
indice_cabin_nan = list(df_copy.loc[df_copy['Cabin'].isnull(),['Cabin']].index)
indice_cabin_nan

[0,
 2,
 4,
 5,
 7,
 8,
 9,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 22,
 24,
 25,
 26,
 28,
 29,
 30,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 53,
 56,
 57,
 58,
 59,
 60,
 63,
 64,
 65,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 89,
 90,
 91,
 93,
 94,
 95,
 98,
 99,
 100,
 101,
 103,
 104,
 105,
 106,
 107,
 108,
 109,
 111,
 112,
 113,
 114,
 115,
 116,
 117,
 119,
 120,
 121,
 122,
 125,
 126,
 127,
 129,
 130,
 131,
 132,
 133,
 134,
 135,
 138,
 140,
 141,
 142,
 143,
 144,
 145,
 146,
 147,
 149,
 150,
 152,
 153,
 154,
 155,
 156,
 157,
 158,
 159,
 160,
 161,
 162,
 163,
 164,
 165,
 167,
 168,
 169,
 171,
 172,
 173,
 175,
 176,
 178,
 179,
 180,
 181,
 182,
 184,
 186,
 187,
 188,
 189,
 190,
 191,
 192,
 196,
 197,
 198,
 199,
 200,
 201,
 202,
 203,
 204,
 206,
 207,
 208,
 210,
 211,
 212,
 213,
 214,
 216,
 217,
 219,
 220,
 221,
 222,
 223,
 225,
 226,
 227,
 228,
 229,
 231,
 232,
 233,
 234,
 235,
 236,
 237,
 238,
 239,
 240,
 241,
 242,
 243,
 244,
 246,
 247,
 249,
 250,
 253,
 254,
 255,
 256,
 258,
 259,
 260,
 261,
 264,
 265,
 266,
 267,
 270,
 271,
 272,
 274,
 276,
 277,
 278,
 279,
 280,
 281,
 282,
 283,
 285,
 286,
 287,
 288,
 289,
 290,
 293,
 294,
 295,
 296,
 300,
 301,
 302,
 304,
 306,
 308,
 312,
 313,
 314,
 315,
 316,
 317,
 320,
 321,
 322,
 323,
 324,
 326,
 328,
 330,
 333,
 334,
 335,
 338,
 342,
 343,
 344,
 346,
 347,
 348,
 349,
 350,
 352,
 353,
 354,
 355,
 357,
 358,
 359,
 360,
 361,
 362,
 363,
 364,
 365,
 367,
 368,
 371,
 372,
 373,
 374,
 375,
 376,
 378,
 379,
 380,
 381,
 382,
 383,
 384,
 385,
 386,
 387,
 388,
 389,
 391,
 392,
 395,
 396,
 397,
 398,
 399,
 400,
 401,
 402,
 403,
 404,
 405,
 406,
 407,
 408,
 409,
 410,
 411,
 413,
 414,
 415,
 416,
 417,
 418,
 419,
 420,
 421,
 422,
 423,
 424,
 425,
 426,
 427,
 428,
 431,
 432,
 433,
 436,
 437,
 439,
 440,
 441,
 442,
 443,
 444,
 446,
 447,
 448,
 450,
 451,
 454,
 455,
 458,
 459,
 461,
 463,
 464,
 465,
 466,
 467,
 468,
 469,
 470,
 471,
 472,
 474,
 476,
 477,
 478,
 479,
 480,
 481,
 482,
 483,
 485,
 488,
 489,
 490,
 491,
 493,
 494,
 495,
 497,
 499,
 500,
 501,
 502,
 503,
 506,
 507,
 508,
 509,
 510,
 511,
 513,
 514,
 517,
 518,
 519,
 521,
 522,
 524,
 525,
 526,
 528,
 529,
 530,
 531,
 532,
 533,
 534,
 535,
 537,
 538,
 541,
 542,
 543,
 545,
 546,
 547,
 548,
 549,
 551,
 552,
 553,
 554,
 555,
 557,
 559,
 560,
 561,
 562,
 563,
 564,
 565,
 566,
 567,
 568,
 569,
 570,
 573,
 574,
 575,
 576,
 578,
 579,
 580,
 582,
 584,
 586,
 588,
 589,
 590,
 592,
 593,
 594,
 595,
 596,
 597,
 598,
 600,
 601,
 602,
 603,
 604,
 605,
 606,
 607,
 608,
 610,
 611,
 612,
 613,
 614,
 615,
 616,
 617,
 619,
 620,
 622,
 623,
 624,
 626,
 628,
 629,
 631,
 633,
 634,
 635,
 636,
 637,
 638,
 639,
 640,
 642,
 643,
 644,
 646,
 648,
 649,
 650,
 651,
 652,
 653,
 654,
 655,
 656,
 657,
 658,
 660,
 661,
 663,
 664,
 665,
 666,
 667,
 668,
 670,
 672,
 673,
 674,
 675,
 676,
 677,
 678,
 680,
 682,
 683,
 684,
 685,
 686,
 687,
 688,
 691,
 692,
 693,
 694,
 695,
 696,
 697,
 702,
 703,
 704,
 705,
 706,
 708,
 709,
 713,
 714,
 718,
 719,
 720,
 721,
 722,
 723,
 725,
 726,
 727,
 728,
 729,
 731,
 732,
 733,
 734,
 735,
 736,
 738,
 739,
 743,
 744,
 746,
 747,
 749,
 750,
 752,
 753,
 754,
 755,
 756,
 757,
 758,
 760,
 761,
 762,
 764,
 766,
 767,
 768,
 769,
 770,
 771,
 773,
 774,
 775,
 777,
 778,
 780,
 783,
 784,
 785,
 786,
 787,
 788,
 790,
 791,
 792,
 793,
 794,
 795,
 797,
 798,
 799,
 800,
 801,
 803,
 804,
 805,
 807,
 808,
 810,
 811,
 812,
 813,
 814,
 816,
 817,
 818,
 819,
 821,
 822,
 824,
 825,
 826,
 827,
 828,
 830,
 831,
 832,
 833,
 834,
 836,
 837,
 838,
 840,
 841,
 842,
 843,
 844,
 845,
 846,
 847,
 848,
 850,
 851,
 852,
 854,
 855,
 856,
 858,
 859,
 860,
 861,
 863,
 864,
 865,
 866,
 868,
 869,
 870,
 873,
 874,
 875,
 876,
 877,
 878,
 880,
 881,
 882,
 883,
 884,
 885,
 886,
 888,
 890]

**Generamos indice para los datos `noNaN`**

In [16]:
# Guarda en la variable los índices de todas las filas donde la columna `Cabin` tiene valores no NaN.
indice_cabin_nonan = list(df_copy.loc[df_copy['Cabin'].notnull(),['Cabin']].index)
indice_cabin_nonan

[1,
 3,
 6,
 10,
 11,
 21,
 23,
 27,
 31,
 52,
 54,
 55,
 61,
 62,
 66,
 75,
 88,
 92,
 96,
 97,
 102,
 110,
 118,
 123,
 124,
 128,
 136,
 137,
 139,
 148,
 151,
 166,
 170,
 174,
 177,
 183,
 185,
 193,
 194,
 195,
 205,
 209,
 215,
 218,
 224,
 230,
 245,
 248,
 251,
 252,
 257,
 262,
 263,
 268,
 269,
 273,
 275,
 284,
 291,
 292,
 297,
 298,
 299,
 303,
 305,
 307,
 309,
 310,
 311,
 318,
 319,
 325,
 327,
 329,
 331,
 332,
 336,
 337,
 339,
 340,
 341,
 345,
 351,
 356,
 366,
 369,
 370,
 377,
 390,
 393,
 394,
 412,
 429,
 430,
 434,
 435,
 438,
 445,
 449,
 452,
 453,
 456,
 457,
 460,
 462,
 473,
 475,
 484,
 486,
 487,
 492,
 496,
 498,
 504,
 505,
 512,
 515,
 516,
 520,
 523,
 527,
 536,
 539,
 540,
 544,
 550,
 556,
 558,
 571,
 572,
 577,
 581,
 583,
 585,
 587,
 591,
 599,
 609,
 618,
 621,
 625,
 627,
 630,
 632,
 641,
 645,
 647,
 659,
 662,
 669,
 671,
 679,
 681,
 689,
 690,
 698,
 699,
 700,
 701,
 707,
 710,
 711,
 712,
 715,
 716,
 717,
 724,
 730,
 737,
 740,
 741,
 742,
 745,
 748,
 751,
 759,
 763,
 765,
 772,
 776,
 779,
 781,
 782,
 789,
 796,
 802,
 806,
 809,
 815,
 820,
 823,
 829,
 835,
 839,
 849,
 853,
 857,
 862,
 867,
 871,
 872,
 879,
 887,
 889]

**Convertimos la columna `Cabin` en una variable binaria:**

- **0** si el valor era faltante (no tenía cabina asignada)  
- **1** si tenía un valor (sí tenía cabina asignada)

Asigna el valor **0** a la columna `Cabin` en todas las filas de `df_copy` cuyos índices están en la lista `indice_cabin_nan`, es decir, donde el valor de `Cabin` **es NaN** (faltante).

In [17]:
df_copy.loc[indice_cabin_nan,['Cabin']] = 0

Asigna el valor **1** a la columna `Cabin` en todas las filas de `df_copy` cuyos índices están en la lista `indice_cabin_nonan`, es decir, donde el valor de `Cabin` **no es NaN** (no faltante).

In [18]:
df_copy.loc[indice_cabin_nonan,['Cabin']] = 1

### **Comprobacion de proporciones correctas**

In [19]:
# Verificacion
df_copy.loc[indice_cabin_nan,['Survived', 'Cabin']]

     Survived Cabin
0           0     0
2           1     0
4           0     0
5           0     0
7           0     0
..        ...   ...
884         0     0
885         0     0
886         0     0
888         0     0
890         0     0

[687 rows x 2 columns]

In [20]:
# Visualizacion de proporcion de 0 y 1
df_copy['Cabin'].value_counts()

Cabin
0    687
1    204
Name: count, dtype: int64

### Creacion Columna Cabin_missing

In [21]:
df_copy['Cabin_missing'] = df_copy['Cabin']

Eliminamos del Dataframe `df_copy` la columna `Cabin`

In [22]:
df_copy.drop('Cabin', axis=1, inplace=True)

Cambio tipo de variable de Object a `Int`

In [23]:
df_copy['Cabin_missing'] = df_copy['Cabin_missing'].astype('Int64')

## Columna Embarked

Asigna el valor **S** a las dos filas de `Embarked` segun las `Acciones a realizar` en la fase exploratoria (EDA)
[Ir a análisis exploratorio](./01_exploration.ipynb)

In [24]:
df_copy.loc[[61, 829],['Embarked']] = 'S'

In [25]:
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Survived       891 non-null    int64
 1   Pclass         891 non-null    int64
 2   Name           891 non-null    object
 3   Sex            891 non-null    object
 4   Age            891 non-null    float64
 5   SibSp          891 non-null    int64
 6   Parch          891 non-null    int64
 7   Ticket         891 non-null    object
 8   Fare           891 non-null    float64
 9   Embarked       891 non-null    object
 10  Cabin_missing  891 non-null    Int64
dtypes: Int64(1), float64(2), int64(4), object(4)
memory usage: 77.6+ KB

## Columna `Sex`

Convertir los datos binarios tipo string de la columna Sex a valores numéricos para el modelado de datos<br>
    ```
    male → 0  ~  female → 1
    ```

Esto segun las `Acciones a realizar` en la fase exploratoria (EDA)
[Ir a análisis exploratorio](./01_exploration.ipynb)

In [26]:
map_sexo = {'male': 0, 'female':1}
df_copy['Sex'] = df_copy['Sex'].map(map_sexo)

In [27]:
# Verificacion
df_copy.info()
df_copy.sample(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Survived       891 non-null    int64
 1   Pclass         891 non-null    int64
 2   Name           891 non-null    object
 3   Sex            891 non-null    int64
 4   Age            891 non-null    float64
 5   SibSp          891 non-null    int64
 6   Parch          891 non-null    int64
 7   Ticket         891 non-null    object
 8   Fare           891 non-null    float64
 9   Embarked       891 non-null    object
 10  Cabin_missing  891 non-null    Int64
dtypes: Int64(1), float64(2), int64(5), object(3)
memory usage: 77.6+ KB

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin_missing
744,1,3,"Stranden, Mr. Juho",0,31.0,0,0,STON/O 2. 3101288,7.9250,S,0
51,0,3,"Nosworthy, Mr. Richard Cater",0,21.0,0,0,A/4. 39886,7.8000,S,0
562,0,2,"Norman, Mr. Robert Douglas",0,28.0,0,0,218629,13.5000,S,0
577,1,1,"Silvey, Mrs. William Baird (Alice Munger)",1,39.0,1,0,13507,55.9000,S,1
124,0,1,"White, Mr. Percival Wayland",0,54.0,0,1,35281,77.2875,S,1

# One hot Encoding

## Columna Embarked

Tranformar los datos categoricos de la columna mediante **One hot encoding** a valores binarios para el modelado de datos<br>
    ```
    'S', 'C' y 'Q'
    ```

Esto segun las `Acciones a realizar` en la fase exploratoria (EDA)
[Ir a análisis exploratorio](./01_exploration.ipynb)

In [ ]:
# Aplica one hot encoding a la columna 'Embarked', creando columnas binarias (0 y 1) para cada clase 
# y las agrega al DataFrame df_copy
df_copy = pd.get_dummies(df_copy, columns=['Embarked'], dtype=int)

## Columna `Pclass`

Tranformar los datos categoricos de la columna mediante **One hot encoding** a valores binarios para el modelado de datos<br>
    ```
    '1', '2' y '3'
    ```

Esto segun las `Acciones a realizar` en la fase exploratoria (EDA)
[Ir a análisis exploratorio](./01_exploration.ipynb)

In [ ]:
# Aplica one hot encoding a la columna 'Pclass', creando columnas binarias (0 y 1) para cada clase 
# y las agrega al DataFrame df_copy
df_copy = pd.get_dummies(df_copy, columns=['Pclass'], dtype=int) # Confirmar el tipo de salida con `dtype`

# Verificacion

In [35]:
df_copy.info()
df_copy.sample(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Survived       891 non-null    int64
 1   Name           891 non-null    object
 2   Sex            891 non-null    int64
 3   Age            891 non-null    float64
 4   SibSp          891 non-null    int64
 5   Parch          891 non-null    int64
 6   Ticket         891 non-null    object
 7   Fare           891 non-null    float64
 8   Cabin_missing  891 non-null    Int64
 9   Pclass_1       891 non-null    int64
 10  Pclass_2       891 non-null    int64
 11  Pclass_3       891 non-null    int64
 12  Embarked_C     891 non-null    int64
 13  Embarked_Q     891 non-null    int64
 14  Embarked_S     891 non-null    int64
dtypes: Int64(1), float64(2), int64(10), object(2)
memory usage: 105.4+ KB

,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin_missing,Pclass_1,Pclass_2,Pclass_3,Embarked_C,Embarked_Q,Embarked_S
378,0,"Betros, Mr. Tannous",0,20.0,0,0,2648,4.0125,0,0,0,1,1,0,0
488,0,"Somerton, Mr. Francis William",0,30.0,0,0,A.5. 18509,8.0500,0,0,0,1,0,0,1
691,1,"Karun, Miss. Manca",1,4.0,0,1,349256,13.4167,0,0,0,1,1,0,0
741,0,"Cavendish, Mr. Tyrell William",0,36.0,1,0,19877,78.8500,1,1,0,0,0,0,1
605,0,"Lindell, Mr. Edvard Bengtsson",0,36.0,1,0,349910,15.5500,0,0,0,1,0,0,1